[
    {
        "title": "Zoning Analysis and Predictive Modeling of Customers Affected in a Power Outage",
        "year" : 2024,
        "image": "https://media.wired.com/photos/61857ab5c4b863206a589936/master/pass/Gear-Prepare-for-Blackouts-1155510644.jpg",
        "description": "Analyzed 1,500+ power outage events in the U.S. to create a model predicting the number of customers affected during a power outage."
    },
    {
        "title": "J.P. Morgan “Data for Good” Hackathon: Reccomendation to SocialWorks Non-Profit",
        "year": 2025,
        "image": "https://media.licdn.com/dms/image/v2/D5622AQEdpA1E6hZWfg/feedshare-shrink_1280/feedshare-shrink_1280/0/1728266064658?e=1741219200&v=beta&t=QMn6LHMlrMAfItBbUu1-NxK2F6WlmSJifWEpEfshcl4",
        "description": "Conducted in-depth market research, exploratory data analysis, and developed a K-NN Classification Model to recommend Chicago neighborhoods that would maximize SocialWorks' non-profit impact."
    },
    {
        "title": "HDSI Undergraduate Research Project: Predicting Homeless Shelter Capacity in San Diego",
        "year": 2025,
        "image": "https://centralca.cdn-anvilcms.net/media/images/2020/09/11/images/1.3.5-Homeless-San-Diego-7.max-752x423.jpg",
        "description": "ML research project which aims to create a model that accurately forecasts short-term and long-term shelter capacity needs and predicts changes in the unsheltered population. By leveraging historical data on shelter usage, weather patterns, economic indicators, and demographic trends, the predictive model should provide insights for policymakers and service providers, helping them optimize resource allocation, improve emergency preparedness, and enhance the overall effectiveness of homelessness interventions.!"
    },
    {
        "title": "Lyrical Landscapes: Mapping Emotional Themes to Music Popularity (2000–2023)",
        "year": 2024,
        "image": "https://www.cnet.com/a/img/resize/034ecacea4dbf0ae76529f37c2d0309b17b557ec/hub/2021/11/10/ab5e2d3b-9a4a-41f0-b2cd-6cee804ce823/genre-charts-covers.png?auto=webp&fit=crop&height=675&width=1200",
        "description": "Using sentiment analysis, which lyrical themes—such as love, empowerment, struggle, anger, hope, celebration, and nostalgia—are most commonly identified in the top songs of Spotify's English-language genres (Pop, Rap, Rock, R&B) from 2000 to 2023?"
    },
    {
        "title": "UCSD SMASH & NSF HDR ML Challenge Hackathon",
        "year": 2025,
        "image": "https://indico.cern.ch/event/1489401/logo-3797433634.png",
        "description": "Utilized the provided LIGO O3 datasets to train models, focusing on detecting unusual patterns in the strain data without relying on pre-defined templates."
    },
    {
        "title": "AI-Powered Stock Analysis",
        "image": "https://m.foolcdn.com/media/dubs/images/original_imageshttpsg.foolcdn.comeditorialimag.width-880_HgZaSBI.jpg",
        "description": "An AI-driven platform that predicts stock price movements based on historical trends and sentiment analysis from news articles."
    },
    {
        "title": "Eco-Friendly Smart Home System",
        "image": "https://cdn.pixabay.com/photo/2018/02/07/12/51/smart-home-3139224_1280.jpg",
        "description": "A smart home automation system that optimizes energy usage and suggests sustainable alternatives for reducing carbon footprint."
    },
    {
        "title": "Personalized Workout Assistant",
        "image": "https://cdn.pixabay.com/photo/2016/08/27/14/35/fitness-1623069_1280.jpg",
        "description": "A mobile app that generates customized workout plans based on user preferences, body metrics, and AI recommendations."
    },
    {
        "title": "Language Learning Chatbot",
        "image": "https://cdn.pixabay.com/photo/2017/01/18/16/17/chatbot-1999342_1280.jpg",
        "description": "An interactive chatbot that helps users practice new languages through AI-driven conversations and speech recognition."
    },
    {
        "title": "AI-Generated Art Gallery",
        "image": "https://cdn.pixabay.com/photo/2017/06/23/18/07/abstract-2436874_1280.jpg",
        "description": "A web-based platform that generates AI-created digital artwork based on user-inputted themes and emotions."
    },
    {
        "title": "Autonomous Drone Delivery",
        "image": "https://cdn.pixabay.com/photo/2018/04/04/11/23/drone-3284299_1280.jpg",
        "description": "An innovative drone delivery service that leverages AI-powered route optimization to enhance efficiency in urban logistics."
    },
    {
        "title": "Smart Resume Analyzer",
        "image": "https://cdn.pixabay.com/photo/2015/01/09/11/09/startup-594090_1280.jpg",
        "description": "An AI-powered tool that analyzes resumes and provides personalized feedback based on job description keywords and industry standards."
    }
]